; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_5 ?v4)
               (pred_2 ?v4)
               (pred_3)
               (pred_4 ?v4)
               (pred_1 ?v4 ?v2))

  (:action op_3
    :parameters (?v1)
    :precondition (and (pred_5 ?v1) (pred_2 ?v1) (pred_3))
    :effect (and (pred_4 ?v1) (not (pred_5 ?v1)) (not (pred_2 ?v1)) 
                 (not (pred_3))))

  (:action op_1
    :parameters  (?v1)
    :precondition (pred_4 ?v1)
    :effect (and (pred_5 ?v1) (pred_3) (pred_2 ?v1) 
                 (not (pred_4 ?v1))))

  (:action op_2
    :parameters  (?v1 ?v3)
    :precondition (and (pred_5 ?v3) (pred_4 ?v1))
    :effect (and (pred_3) (pred_5 ?v1) (pred_1 ?v1 ?v3)
                 (not (pred_5 ?v3)) (not (pred_4 ?v1))))

  (:action op_4
    :parameters  (?v1 ?v3)
    :precondition (and (pred_1 ?v1 ?v3) (pred_5 ?v1) (pred_3))
    :effect (and (pred_4 ?v1) (pred_5 ?v3)
                 (not (pred_1 ?v1 ?v3)) (not (pred_5 ?v1)) (not (pred_3)))))

; problem
(define (problem BW-rand-4)
(:domain blocksworld)
(:objects obj_03 obj_01 obj_04 obj_02 )
(:init
(pred_3)
(pred_2 obj_03)
(pred_1 obj_01 obj_04)
(pred_2 obj_04)
(pred_1 obj_02 obj_01)
(pred_5 obj_03)
(pred_5 obj_02)
)
(:goal
(and
(pred_1 obj_03 obj_04)
(pred_2 obj_01)
(pred_1 obj_04 obj_02)
(pred_2 obj_02))
)

(:constraints
  (sometime-before (pred_2 obj_01) (pred_1 obj_03 obj_04))
)
)

; plan
1. (op_4 obj_02 obj_01)
   deleted: (pred_1 obj_02 obj_01) (pred_5 obj_02) (pred_3)
   added: (pred_4 obj_02) (pred_5 obj_01)
   goals met: 0 of 4
2. (op_1 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_5 obj_02) (pred_3) (pred_2 obj_02)
   goals met: 1 of 4
3. (op_4 obj_01 obj_04)
   deleted: (pred_1 obj_01 obj_04) (pred_5 obj_01) (pred_3)
   added: (pred_4 obj_01) (pred_5 obj_04)
   goals met: 1 of 4
4. (op_2 obj_01 obj_02)
   deleted: (pred_5 obj_02) (pred_4 obj_01)
   added: (pred_3) (pred_5 obj_01) (pred_1 obj_01 obj_02)
   goals met: 1 of 4
5. (op_3 obj_03)
   deleted: (pred_5 obj_03) (pred_2 obj_03) (pred_3)
   added: (pred_4 obj_03)
   goals met: 1 of 4
6. (op_2 obj_03 obj_04)
   deleted: (pred_5 obj_04) (pred_4 obj_03)
   added: (pred_3) (pred_5 obj_03) (pred_1 obj_03 obj_04)
   goals met: 2 of 4
7. (op_4 obj_01 obj_02)
   deleted: (pred_1 obj_01 obj_02) (pred_5 obj_01) (pred_3)
   added: (pred_4 obj_01) (pred_5 obj_02)
   goals met: 2 of 4
8. (op_1 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_5 obj_01) (pred_3) (pred_2 obj_01)
   goals met: 3 of 4
9. (op_4 obj_03 obj_04)
   deleted: (pred_1 obj_03 obj_04) (pred_5 obj_03) (pred_3)
   added: (pred_4 obj_03) (pred_5 obj_04)
   goals met: 2 of 4
10. (op_1 obj_03)
   deleted: (pred_4 obj_03)
   added: (pred_5 obj_03) (pred_3) (pred_2 obj_03)
   goals met: 2 of 4
11. (op_3 obj_04)
   deleted: (pred_5 obj_04) (pred_2 obj_04) (pred_3)
   added: (pred_4 obj_04)
   goals met: 2 of 4
12. (op_2 obj_04 obj_02)
   deleted: (pred_5 obj_02) (pred_4 obj_04)
   added: (pred_3) (pred_5 obj_04) (pred_1 obj_04 obj_02)
   goals met: 3 of 4
13. (op_3 obj_03)
   deleted: (pred_5 obj_03) (pred_2 obj_03) (pred_3)
   added: (pred_4 obj_03)
   goals met: 3 of 4
14. (op_2 obj_03 obj_04)
   deleted: (pred_5 obj_04) (pred_4 obj_03)
   added: (pred_3) (pred_5 obj_03) (pred_1 obj_03 obj_04)
   goals met: 4 of 4
